print('4th program') # текстовая строкаprint('3rd program') # текстовая строка
# Дана строка 123.456
print ('123.456') #Вывод строки на дисплей
print((float(123.456)*10), 'Дробное число')
print (int(123.456)*10, "Целое число")
# print(int((float(123.456)*10))-int(123.456)*10, "Ответ")
print(int((float(123.456)*10) %10), "Ответ")
print (int(22.34) %10)